/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 50718
Source Host           : localhost:3306
Source Database       : air_ticket

Target Server Type    : MYSQL
Target Server Version : 50718
File Encoding         : 65001

Date: 2018-02-08 12:46:36
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for air_ticket
-- ----------------------------
DROP TABLE IF EXISTS `air_ticket`;
CREATE TABLE `air_ticket` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `source` varchar(255) DEFAULT NULL COMMENT '来源',
  `time` varchar(255) DEFAULT NULL COMMENT '航班时间',
  `depart` varchar(255) DEFAULT NULL COMMENT '出发地',
  `arrive` varchar(255) DEFAULT NULL COMMENT '目的地',
  `airline` varchar(255) DEFAULT NULL COMMENT '航空公司信息',
  `flight` varchar(255) DEFAULT NULL COMMENT '航班信息',
  `depart_time` varchar(255) DEFAULT NULL COMMENT '出发时间',
  `arrive_time` varchar(255) DEFAULT NULL COMMENT '到达时间',
  `space_time` varchar(255) DEFAULT NULL COMMENT '花费时间',
  `depart_airport` varchar(255) DEFAULT NULL COMMENT '出发机场',
  `arrive_airport` varchar(255) DEFAULT NULL COMMENT '到达机场',
  `price` decimal(10,2) DEFAULT NULL COMMENT '价格',
  `create_time` datetime DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP,
  `update_time` datetime DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=257 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of air_ticket
-- ----------------------------
INSERT INTO `air_ticket` VALUES ('227', '去哪儿', '2018-02-09', '成都', '昆明', '厦门航空', 'MF3118 空客330(宽)', '21:55', '23:25', '1小时30分钟', '双流机场T2', '长水机场', '4520.00', '2018-02-08 12:44:31', null);
INSERT INTO `air_ticket` VALUES ('228', '去哪儿', '2018-02-09', '成都', '昆明', '南方航空', 'CZ9597 空客330(宽)', '21:55', '23:25', '1小时30分钟', '双流机场T2', '长水机场', '710.00', '2018-02-08 12:44:32', null);
INSERT INTO `air_ticket` VALUES ('229', '去哪儿', '2018-02-09', '成都', '昆明', '中国国航', 'CA4417 空客319(中)', '20:25', '22:05', '1小时40分钟', '双流机场T2', '长水机场', '470.00', '2018-02-08 12:44:34', null);
INSERT INTO `air_ticket` VALUES ('230', '去哪儿', '2018-02-09', '成都', '昆明', '厦门航空', 'MF3114 波音737(中)', '13:45', '15:20', '1小时35分钟', '双流机场T2', '长水机场', '4520.00', '2018-02-08 12:44:35', null);
INSERT INTO `air_ticket` VALUES ('231', '去哪儿', '2018-02-09', '成都', '昆明', '南方航空', 'CZ9593 波音737(中)', '13:45', '15:20', '1小时35分钟', '双流机场T2', '长水机场', '840.00', '2018-02-08 12:44:36', null);
INSERT INTO `air_ticket` VALUES ('232', '去哪儿', '2018-02-09', '成都', '昆明', '四川航空', '3U5128 波音737(中)', '13:45', '15:20', '1小时35分钟', '双流机场T2', '长水机场', '760.00', '2018-02-08 12:44:37', null);
INSERT INTO `air_ticket` VALUES ('233', '去哪儿', '2018-02-09', '成都', '昆明', '东方航空', 'MU5844 波音737(中)', '13:45', '15:20', '1小时35分钟', '双流机场T2', '长水机场', '720.00', '2018-02-08 12:44:38', null);
INSERT INTO `air_ticket` VALUES ('234', '去哪儿', '2018-02-09', '成都', '昆明', '南方航空', 'CZ9591 波音737(中)', '10:25', '12:10', '1小时45分钟', '双流机场T2', '长水机场', '710.00', '2018-02-08 12:44:39', null);
INSERT INTO `air_ticket` VALUES ('235', '去哪儿', '2018-02-09', '成都', '昆明', '厦门航空', 'MF3009 波音737(中)', '07:30', '09:10', '1小时40分钟', '双流机场T2', '长水机场', '4520.00', '2018-02-08 12:44:40', null);
INSERT INTO `air_ticket` VALUES ('236', '去哪儿', '2018-02-09', '成都', '昆明', '成都航空', 'EU2223 空客319(中)', '06:35', '08:15', '1小时40分钟', '双流机场T2', '长水机场', '424.00', '2018-02-08 12:44:41', null);
INSERT INTO `air_ticket` VALUES ('237', '携程', '2018-02-09', '成都', '昆明', '东方航空', 'MU5844 波音 737-900ER(中型)', '13:45', '15:20', '', '双流国际机场T2', '长水国际机场', '720.00', '2018-02-08 12:44:47', null);
INSERT INTO `air_ticket` VALUES ('238', '携程', '2018-02-09', '成都', '昆明', '南方航空', 'CZ9566 波音 737-800(中型)', '07:30', '09:10', '', '双流国际机场T2', '长水国际机场', '710.00', '2018-02-08 12:44:47', null);
INSERT INTO `air_ticket` VALUES ('239', '携程', '2018-02-09', '成都', '昆明', '中国国航', 'CA415 空中客车 A319(中型)', '08:15', '09:50', '', '双流国际机场T2', '长水国际机场', '600.00', '2018-02-08 12:44:47', null);
INSERT INTO `air_ticket` VALUES ('240', '携程', '2018-02-09', '成都', '昆明', '中国国航', 'CA3989 空中客车 A319(中型)', '23:25', '01:00', '', '双流国际机场T2', '长水国际机场', '580.00', '2018-02-08 12:44:47', null);
INSERT INTO `air_ticket` VALUES ('241', '携程', '2018-02-09', '成都', '昆明', '中国国航', 'CA5740 波音 737-800(中型)', '11:15', '12:50', '', '双流国际机场T2', '长水国际机场', '580.00', '2018-02-08 12:44:48', null);
INSERT INTO `air_ticket` VALUES ('242', '携程', '2018-02-09', '成都', '昆明', '昆明航空', 'KY4459 空中客车 A320(中型)', '21:45', '23:20', '', '双流国际机场T2', '长水国际机场', '570.00', '2018-02-08 12:44:48', null);
INSERT INTO `air_ticket` VALUES ('243', '携程', '2018-02-09', '成都', '昆明', '祥鹏航空', '8L9948 波音 737-800(中型)', '16:55', '18:30', '', '双流国际机场T2', '长水国际机场', '530.00', '2018-02-08 12:44:48', null);
INSERT INTO `air_ticket` VALUES ('244', '携程', '2018-02-09', '成都', '昆明', '东方航空', 'MU5846 空中客车 A330-200E(大型)', '11:20', '12:45', '', '双流国际机场T2', '长水国际机场', '520.00', '2018-02-08 12:44:48', null);
INSERT INTO `air_ticket` VALUES ('245', '携程', '2018-02-09', '成都', '昆明', '中国国航', 'CA4459 空中客车 A320(中型)', '21:45', '23:20', '', '双流国际机场T2', '长水国际机场', '470.00', '2018-02-08 12:44:48', null);
INSERT INTO `air_ticket` VALUES ('246', '携程', '2018-02-09', '成都', '昆明', '瑞丽航空', 'DR6522 波音 737(中型)', '22:50', '00:30', '', '双流国际机场T2', '长水国际机场', '415.00', '2018-02-08 12:44:48', null);
INSERT INTO `air_ticket` VALUES ('247', '途牛', '2018-02-09', '成都', '昆明', '瑞丽航空', 'DR6522 73B(中)', '22:50', '00:30', '1h40m', '双流T2', '长水', '460.00', '2018-02-08 12:44:51', null);
INSERT INTO `air_ticket` VALUES ('248', '途牛', '2018-02-09', '成都', '昆明', '中国国际航空', 'CA4459 320(中)', '21:45', '23:20', '1h35m', '双流T2', '长水', '470.00', '2018-02-08 12:44:51', null);
INSERT INTO `air_ticket` VALUES ('249', '途牛', '2018-02-09', '成都', '昆明', '红土航空', 'A67102 321(中)', '21:20', '22:45', '1h25m', '双流T2', '长水', '450.00', '2018-02-08 12:44:51', null);
INSERT INTO `air_ticket` VALUES ('250', '途牛', '2018-02-09', '成都', '昆明', '昆明航空', 'KY4417 319', '20:25', '22:05', '1h40m', '双流T2', '长水', '570.00', '2018-02-08 12:44:51', null);
INSERT INTO `air_ticket` VALUES ('251', '途牛', '2018-02-09', '成都', '昆明', '中国东方航空', 'MU5844 73E', '13:45', '15:20', '1h35m', '双流T2', '长水', '720.00', '2018-02-08 12:44:51', null);
INSERT INTO `air_ticket` VALUES ('252', '途牛', '2018-02-09', '成都', '昆明', '中国东方航空', 'MU5846 33E(大)', '11:20', '12:45', '1h25m', '双流T2', '长水', '520.00', '2018-02-08 12:44:51', null);
INSERT INTO `air_ticket` VALUES ('253', '途牛', '2018-02-09', '成都', '昆明', '中国国际航空', 'CA5740 738(中)', '11:15', '12:50', '1h35m', '双流T2', '长水', '580.00', '2018-02-08 12:44:51', null);
INSERT INTO `air_ticket` VALUES ('254', '途牛', '2018-02-09', '成都', '昆明', '昆明航空', 'KY4413 320(中)', '11:15', '12:45', '1h30m', '双流T2', '长水', '1180.00', '2018-02-08 12:44:52', null);
INSERT INTO `air_ticket` VALUES ('255', '途牛', '2018-02-09', '成都', '昆明', '成都航空', 'EU2223 319', '06:35', '08:15', '1h40m', '双流T2', '长水', '452.00', '2018-02-08 12:44:52', null);
INSERT INTO `air_ticket` VALUES ('256', '途牛', '2018-02-09', '成都', '昆明', '西藏航空', 'TV9939 319', '23:25', '01:00', '1h35m', '双流T2', '长水', '380.00', '2018-02-08 12:44:52', null);
